XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B31A_DFP.pdsc
    <condition id="anyOf.component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_spi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.component.serial_manager, anyOf=allOf=driver.spi, component.spi_adapter, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, anyOf=allOf=driver.spi, component.spi_adapter, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="anyOf.allOf=driver.spi, component.spi_adapter.internal_condition"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.spi, component.spi_adapter.internal_condition">
      <accept condition="allOf.driver.spi, component.spi_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.driver.spi, component.spi_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_adapter"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.component.lpuart_adapter, component.serial_manager, anyOf=driver.lpuart, driver.uart, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, component.serial_manager, anyOf=driver.lpuart, driver.uart, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="anyOf.driver.lpuart, driver.uart.internal_condition"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart, driver.uart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, driver.common, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="component.spi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.spi, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.spi, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, anyOf=component.tpm_adapter, component.lptmr_adapter, component.pit_adapter, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, anyOf=component.tpm_adapter, component.lptmr_adapter, component.pit_adapter, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="anyOf.component.tpm_adapter, component.lptmr_adapter, component.pit_adapter.internal_condition"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="anyOf.component.tpm_adapter, component.lptmr_adapter, component.pit_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="tpm_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="pit_adapter"/>
    </condition>
    <condition id="component.tpm_adapter.condition_id">
      <require condition="allOf.driver.common, driver.tpm, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="component.uart_adapter.condition_id">
      <require condition="allOf.driver.common, driver.uart, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.uart, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="device.K32L2B31A_CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device_id=K32L2B31xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device_id=K32L2B31xxxxA.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device_id.K32L2B31xxxxA.internal_condition"/>
    </condition>
    <condition id="device.K32L2B31A_linker.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L2B31xxxxA.internal_condition">
      <require condition="device_id.K32L2B31xxxxA.internal_condition"/>
    </condition>
    <condition id="device_ids.K32L2B31xxxxA.internal_condition">
      <accept Dname="K32L2B31VFM0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B31VFT0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B31VLH0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B31VMP0A" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=K32L2B31xxxxA.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.K32L2B31xxxxA.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=K32L2B31xxxxA.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.K32L2B31xxxxA.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
