XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B31A_DFP.pdsc
    <condition id="allOf.toolchains=iar, device_ids=K32L2B31xxxxA.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.K32L2B31xxxxA.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.K32L2B31A_startup.condition_id">
      <require condition="allOf.device.K32L2B31A_system, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.device.K32L2B31A_system, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L2B31A_system"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.K32L2B31A_system.condition_id">
      <require condition="allOf.device.K32L2B31A_CMSIS, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.device.K32L2B31A_CMSIS, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L2B31A_header"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.adc16.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition">
      <require condition="device_id.K32L2B31xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.cmp.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_i2c.condition_id">
      <require condition="allOf.driver.i2c_dma, device_id=K32L2B31xxxxA, driver.i2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.i2c_dma, device_id=K32L2B31xxxxA, driver.i2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma"/>
      <require condition="device_id.K32L2B31xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.driver.lpuart_dma, device_id=K32L2B31xxxxA, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart_dma, device_id=K32L2B31xxxxA, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_dma"/>
      <require condition="device_id.K32L2B31xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_spi.condition_id">
      <require condition="allOf.driver.spi_dma, device_id=K32L2B31xxxxA, driver.spi, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.spi_dma, device_id=K32L2B31xxxxA, driver.spi, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
      <require condition="device_id.K32L2B31xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_uart.condition_id">
      <require condition="allOf.driver.uart_dma, device_id=K32L2B31xxxxA, driver.uart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.uart_dma, device_id=K32L2B31xxxxA, driver.uart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_dma"/>
      <require condition="device_id.K32L2B31xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.driver.clock, device.K32L2B31A_CMSIS, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.clock, device.K32L2B31A_CMSIS, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L2B31A_header"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm0p.condition_id">
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="cores.cm0p.internal_condition">
      <accept Dcore="Cortex-M0+"/>
    </condition>
    <condition id="driver.cop.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
