XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B31A_DFP.pdsc
    <condition id="driver.dac.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dma.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.dmamux, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L2B31xxxxA, driver.dmamux, driver.common.internal_condition">
      <require condition="device_id.K32L2B31xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flash.condition_id">
      <require condition="allOf.driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s_dma.condition_id">
      <require condition="allOf.driver.dma, driver.flexio_i2s, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.flexio_i2s, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_dma.condition_id">
      <require condition="allOf.driver.dma, driver.flexio_spi, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.flexio_spi, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_dma.condition_id">
      <require condition="allOf.driver.dma, driver.flexio_uart, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.flexio_uart, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=K32L2B31A.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.i2c.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.i2c_dma.condition_id">
      <require condition="allOf.driver.dma, driver.i2c, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.i2c, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.llwu.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_dma.condition_id">
      <require condition="allOf.driver.dma, driver.lpuart, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.lpuart, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=K32L2B31A.internal_condition"/>
    </condition>
