XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B31A_DFP.pdsc
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.pit.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.pmc.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.port.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.rcm.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.rtc.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.sim.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.slcd.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.slcd_engine.condition_id">
      <require condition="anyOf.driver.slcd_lcd_s401m16kr.internal_condition"/>
      <require condition="allOf.device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.slcd_lcd_s401m16kr.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_lcd_s401m16kr"/>
    </condition>
    <condition id="device.K32L2B11A.internal_condition">
      <accept Dname="K32L2B11VFM0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B11VFT0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B11VLH0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B11VMP0A" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.K32L2B21A.internal_condition">
      <accept Dname="K32L2B21VFM0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B21VFT0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B21VLH0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B21VMP0A" Dvendor="NXP:11"/>
    </condition>
    <condition id="driver.slcd_lcd_s401m16kr.condition_id">
      <require condition="allOf.board=frdmk32l2b, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.board=frdmk32l2b, device=K32L2B31A.internal_condition">
      <require condition="board.frdmk32l2b.internal_condition"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="board.frdmk32l2b.internal_condition">
      <accept condition="device.K32L2B11A.internal_condition"/>
      <accept condition="device.K32L2B21A.internal_condition"/>
      <accept condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.smc.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.spi.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.spi_dma.condition_id">
      <require condition="allOf.driver.dma, driver.spi, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.spi, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.tpm.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.uart.condition_id">
      <require condition="allOf.driver.common, device_id=K32L2B31xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=K32L2B31xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.K32L2B31xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.uart_dma.condition_id">
      <require condition="allOf.driver.dma, driver.uart, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.uart, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.vref.condition_id">
      <require condition="allOf.device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="middleware.baremetal.condition_id">
      <require condition="allOf.device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="utilities.misc_utilities.condition_id">
      <require condition="allOf.device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="utility.assert.condition_id">
      <require condition="allOf.utility.debug_console, driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console, driver.common, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="utility.assert_lite.condition_id">
      <require condition="allOf.utility.debug_console_lite, driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console_lite, driver.common, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="utility.debug_console.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="utility.debug_console_lite.condition_id">
      <require condition="allOf.component.lpuart_adapter, device_id=K32L2B31xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device_id=K32L2B31xxxxA, driver.common.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device_id.K32L2B31xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
