XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B31A_DFP.pdsc
    <condition id="utility.notifier.condition_id">
      <require condition="allOf.driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="utility.shell.condition_id">
      <require condition="allOf.utility.str, component.lists, driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
    <condition id="allOf.utility.str, component.lists, driver.common, device=K32L2B31A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="utility.str.condition_id">
      <require condition="allOf.driver.common, device=K32L2B31A.internal_condition"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="K32L2B31A" Cversion="1.0.0" condition="DEVICES_Project_Template.K32L2B31A.condition_id" isDefaultVariant="1">
      <description>Devices_project_template K32L2B31A</description>
      <files>
        <file category="header" attr="config" name="devices/K32L2B31A/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/K32L2B31A/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/K32L2B31A/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/K32L2B31A/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/K32L2B31A/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/K32L2B31A/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/K32L2B31A/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/K32L2B31A/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/K32L2B31A/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="RTE_Device.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/K32L2B31A/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/K32L2B31A/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="cmake_toolchain" Cversion="1.0.0" condition="cmake_toolchain.condition_id">
      <description>Cmake_toolchain</description>
      <files>
        <file category="other" name="tools/cmake_toolchain_files/armgcc.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/xcc.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/xclang.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/armgcc_force_cpp.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/mcux_config.cmake" projectpath="cmake_toolchain_files"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="button" Cversion="1.0.0" condition="component.button.condition_id">
      <description>Component button</description>
      <files>
        <file category="header" name="components/button/fsl_component_button.h" projectpath="component/button"/>
        <file category="sourceC" name="components/button/fsl_component_button.c" projectpath="component/button"/>
        <file category="include" name="components/button/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_AT25Fxxxx" Cversion="1.0.0" condition="component.eeprom_AT25Fxxxx.condition_id">
      <description>Component eeprom_at25fxxxx</description>
      <RTE_Components_h>
#ifndef SPI_DUMMYDATA
#define SPI_DUMMYDATA 0
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/extern_flash/fsl_adapter_eeprom.h" projectpath="component/extern_flash"/>
        <file category="sourceC" name="components/extern_flash/fsl_adapter_eeprom_AT25Fxxxx.c" projectpath="component/extern_flash"/>
        <file category="include" name="components/extern_flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_AT45DBxxxx" Cversion="1.0.0" condition="component.eeprom_AT45DBxxxx.condition_id">
      <description>Component eeprom_at45dbxxxx</description>
      <files>
        <file category="header" name="components/extern_flash/fsl_adapter_eeprom.h" projectpath="component/extern_flash"/>
        <file category="sourceC" name="components/extern_flash/fsl_adapter_eeprom_AT45DBxxxx.c" projectpath="component/extern_flash"/>
        <file category="include" name="components/extern_flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_InternalFlash" Cversion="1.0.0" condition="component.eeprom_InternalFlash.condition_id">
      <description>Component eeprom_internalflash</description>
      <files>
        <file category="header" name="components/extern_flash/fsl_adapter_eeprom.h" projectpath="component/extern_flash"/>
        <file category="sourceC" name="components/extern_flash/fsl_adapter_eeprom_InternalFlash.c" projectpath="component/extern_flash"/>
        <file category="include" name="components/extern_flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flash_adapter" Cversion="1.0.0" condition="component.flash_adapter.condition_id">
      <description>Component flash_adapter</description>
      <files>
        <file category="header" name="components/internal_flash/fsl_adapter_flash.h" projectpath="component/internal_flash"/>
        <file category="sourceC" name="components/internal_flash/fsl_adapter_flash.c" projectpath="component/internal_flash"/>
        <file category="include" name="components/internal_flash/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio_adapter" Cversion="1.0.1" condition="component.gpio_adapter.condition_id">
      <description>Component gpio_adapter</description>
      <files>
        <file category="header" name="components/gpio/fsl_adapter_gpio.h" projectpath="component/gpio"/>
        <file category="sourceC" name="components/gpio/fsl_adapter_gpio.c" projectpath="component/gpio"/>
        <file category="include" name="components/gpio/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter" Cversion="1.0.0" condition="component.i2c_adapter.condition_id">
      <description>Component i2c_adapter</description>
      <files>
        <file category="header" name="components/i2c/fsl_adapter_i2c.h" projectpath="component/i2c"/>
        <file category="sourceC" name="components/i2c/fsl_adapter_i2c.c" projectpath="component/i2c"/>
        <file category="include" name="components/i2c/"/>
      </files>
    </component>
