XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B31A_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.3" condition="driver.cmp.condition_id">
      <description>CMP Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_cmp.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_cmp.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="i2c_cmsis" Cversion="2.2.0" Capiversion="2.3.0" condition="driver.cmsis_i2c.condition_id">
      <description>I2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L2B31A/cmsis_drivers/fsl_i2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/cmsis_drivers/fsl_i2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.5.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L2B31A/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="spi_cmsis" Cversion="2.3.0" Capiversion="2.2.0" condition="driver.cmsis_spi.condition_id">
      <description>SPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L2B31A/cmsis_drivers/fsl_spi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/cmsis_drivers/fsl_spi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="uart_cmsis" Cversion="2.1.0" Capiversion="2.3.0" condition="driver.cmsis_uart.condition_id">
      <description>UART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L2B31A/cmsis_drivers/fsl_uart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/cmsis_drivers/fsl_uart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.4.0" condition="driver.common.condition_id">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="sourceC" name="devices/K32L2B31A/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="header" name="devices/K32L2B31A/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cop" Cversion="2.0.1" condition="driver.cop.condition_id">
      <description>COP Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_cop.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_cop.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dac" Cversion="2.0.2" condition="driver.dac.condition_id">
      <description>DAC Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_dac.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_dac.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dma" Cversion="2.1.2" condition="driver.dma.condition_id">
      <description>DMA Driver</description>
      <files>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.1.0" condition="driver.dmamux.condition_id">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_dmamux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_dmamux.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flash" Cversion="3.1.3" condition="driver.flash.condition_id">
      <description>Flash Driver</description>
      <files>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_ftfx_adapter.h" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_ftfx_utilities.h" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_ftfx_features.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_ftfx_controller.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_ftfx_controller.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_ftfx_flash.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_ftfx_flash.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_ftfx_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_ftfx_cache.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_ftfx_flexnvm.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_ftfx_flexnvm.h" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_flash.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
