XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B31A_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio" Cversion="2.2.2" condition="driver.flexio.condition_id">
      <description>FLEXIO Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_flexio.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_flexio.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2c_master" Cversion="2.5.0" condition="driver.flexio_i2c_master.condition_id">
      <description>FLEXIO I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_flexio_i2c_master.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_flexio_i2c_master.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s" Cversion="2.2.0" condition="driver.flexio_i2s.condition_id">
      <description>FLEXIO I2S Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_flexio_i2s.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_flexio_i2s.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s_dma" Cversion="2.1.7" condition="driver.flexio_i2s_dma.condition_id">
      <description>FLEXIO I2S DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_flexio_i2s_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_flexio_i2s_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi" Cversion="2.3.3" condition="driver.flexio_spi.condition_id">
      <description>FLEXIO SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_flexio_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_flexio_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi_dma" Cversion="2.3.0" condition="driver.flexio_spi_dma.condition_id">
      <description>FLEXIO SPI DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_flexio_spi_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_flexio_spi_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart" Cversion="2.5.0" condition="driver.flexio_uart.condition_id">
      <description>FLEXIO UART Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_flexio_uart.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_flexio_uart.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart_dma" Cversion="2.4.0" condition="driver.flexio_uart_dma.condition_id">
      <description>FLEXIO UART DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_flexio_uart_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_flexio_uart_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft5406" Cversion="1.0.0" condition="driver.ft5406.condition_id">
      <description>Driver ft5406</description>
      <files>
        <file category="header" name="components/ft5406/fsl_ft5406.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/ft5406/fsl_ft5406.c" projectpath="touchpanel"/>
        <file category="include" name="components/ft5406/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft6x06" Cversion="1.0.0" condition="driver.ft6x06.condition_id">
      <description>Driver ft6x06</description>
      <files>
        <file category="header" name="components/ft6x06/fsl_ft6x06.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/ft6x06/fsl_ft6x06.c" projectpath="touchpanel"/>
        <file category="include" name="components/ft6x06/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxos8700cq" Cversion="1.0.0" condition="driver.fxos8700cq.condition_id">
      <description>Driver fxos8700cq</description>
      <files>
        <file category="header" name="components/fxos8700cq/fsl_fxos.h" projectpath="accel"/>
        <file category="sourceC" name="components/fxos8700cq/fsl_fxos.c" projectpath="accel"/>
        <file category="include" name="components/fxos8700cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.7.3" condition="driver.gpio.condition_id">
      <description>GPIO Driver</description>
      <files>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_gpio.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_gpio.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.0.9" condition="driver.i2c.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="header" name="devices/K32L2B31A/drivers/fsl_i2c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B31A/drivers/fsl_i2c.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B31A/drivers/"/>
      </files>
    </component>
